// Posledovatelnost.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath> 
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");

	double x;
	double y;
	double a;

	cout << "Введите x\n ";
	cin >> x;

	cout << "ВВедите y\n ";
	cin >> y;

	cout << x << endl;
	cout << y << endl;

	a = (14 * sin(x) + pow(y, 2)) / (0.92 * pow(cos(x), 3));

	cout << "Результат вычеслений =";
	cout << a << endl;

	system("pause");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
